app/views/company_profiles/show.html.erb

<h3>Job Postings</h3>
<% if !@company_profile.job_postings.empty? %>
---
SELECT "job_postings".* FROM "job_postings" WHERE "job_postings"."company_profile_id" = 1
SELECT COUNT(*) FROM "job_postings" WHERE "job_postings"."company_profile_id" = 1