app/views/student_profiles/show.html.erb


<% if !@student_profile.stu_work_experiences.empty? %>
---
SELECT "stu_work_experiences".* FROM "stu_work_experiences" WHERE "stu_work_experiences"."student_profile_id" = 2


<% if !@student_profile.skills.empty? %>
---
SELECT "skills".* FROM "skills" WHERE "skills"."student_profile_id" = 2


<% if !@student_profile.stu_references.empty? %>
---
SELECT "stu_references".* FROM "stu_references" WHERE "stu_references"."student_profile_id" = 2