app/views/job_postings/index.html.erb

      <tr>
        <% com_prof = CompanyProfile.find(job_posting.company_profile_id) %>
---
SELECT "company_profiles".* FROM "company_profiles" WHERE "company_profiles"."id" = ? LIMIT 1  [["id", 1]]