app/views/job_postings/search.html.erb

SELECT "company_profiles".* FROM "company_profiles" WHERE "company_profiles"."id" = ? LIMIT 1  [["id", 1]]
---
            <tr>
              <% com_prof = CompanyProfile.find(job_posting.company_profile_id) %>