app/controllers/company_profiles_controller.rb

  def index
    @company_profiles = CompanyProfile.all
---
SELECT "company_profiles".* FROM "company_profiles"

  def show
    @company_profile = CompanyProfile.find(params[:id])
---
SELECT "company_profiles".* FROM "company_profiles" WHERE "company_profiles"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @company_profile = CompanyProfile.find(params[:id])
---
SELECT "company_profiles".* FROM "company_profiles" WHERE "company_profiles"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @company_profile = CompanyProfile.new(params[:company_profile])
    @cur_user = current_user
    @company_profile.user_id = @cur_user.id
    @company_profile.id = @cur_user.id
    @company_profile.email = @cur_user.email

    respond_to do |format|
      if @company_profile.save
---
INSERT INTO "company_profiles" ("company_name", "company_type", "created_at", "description", "email", "id", "location", "number_of_employees", "qsort", "tax_code", "updated_at", "user_id", "verified", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @company_profile = CompanyProfile.find(params[:id])

    respond_to do |format|
      if @company_profile.update_attributes(params[:company_profile])
---
SELECT "company_profiles".* FROM "company_profiles" WHERE "company_profiles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "company_profiles" SET "description" = 'The Apportable SDK automatically converts iOS applications to Android, without extensive changes to the original codebase. Optimized for performance.', "updated_at" = '2014-10-13 18:54:11.074220' WHERE "company_profiles"."id" = 1