app/controllers/job_postings_controller.rb

  def index
    @job_postings = JobPosting.all
---
SELECT "job_postings".* FROM "job_postings"

  def search()

    @job_postings_all = JobPosting.all
    @saved = SavedJobPosting.find_all_by_student_profile_id(@user.id)
    @return = []
    @cultures = ['']
    Groups.all.each do |culture|
---
SELECT "job_postings".* FROM "job_postings" WHERE (Position LIKE '%Software Engineer%')
SELECT "saved_job_postings".* FROM "saved_job_postings" WHERE "saved_job_postings"."student_profile_id" = 2
SELECT "groups".* FROM "groups"

        #culture is set but there are no search hits
        if @job_postings.nil?
          @job_postings_all.each do |profile|
            if CompanyProfile.find(profile.company_profile_id).qsort == params[:culture]
---
SELECT "company_profiles".* FROM "company_profiles" WHERE "company_profiles"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @job_posting = JobPosting.new(params[:job_posting])
    @job_posting.user_id = @user.id
    @job_posting.company_profile_id = @user.id
    @job_posting.posted_on = Time.now

    respond_to do |format|
      if @job_posting.save
---
INSERT INTO "job_postings" ("company_profile_id", "created_at", "job_description", "job_end", "job_id", "job_paid", "job_requirements", "job_start", "position", "position_time", "posted_on", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)