app/controllers/qsorts_controller.rb

SELECT "qsorts".* FROM "qsorts"
---
  def index
    #@qsorts = Qsort.all
    #@qsorts = Qsort.order('qsorts.position ASC')
    @id = current_user.id.to_s

    @lines = File.read('public/qsort.txt').split("\n")

    @h = Hash.new
    @lines.each do |line|
      s = line.split(' ', 2)
      @h[s[0]] = s[1]
    end

    if !@h[@id].nil?
      s = @h[@id].split()
      @qsorts = []
      s.each do |id|
        @qsorts.append(Qsort.find(id))
      end
    else
      @qsorts = Qsort.all