app/controllers/skills_controller.rb

  def create
    @skill = Skill.new(params[:skill])
    @user = current_user
    @skill.user_id = @user.id
    @skill.student_profile_id = @user.id

    respond_to do |format|
      if @skill.save
---
INSERT INTO "skills" ("created_at", "description", "student_profile_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 13 Oct 2014 14:23:45 UTC +00:00], ["description", "Learn"], ["student_profile_id", 3], ["updated_at", Mon, 13 Oct 2014 14:23:45 UTC +00:00], ["user_id", 3]]