app/controllers/stu_references_controller.rb

  def create
    @stu_reference = StuReference.new(params[:stu_reference])
	@user = current_user
	@stu_reference.uid = @user.id
	@stu_reference.student_profile_id = @user.id

    respond_to do |format|
      if @stu_reference.save
---
INSERT INTO "stu_references" ("created_at", "email", "name", "phone", "relationship", "student_profile_id", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)