app/controllers/stu_work_experiences_controller.rb

SELECT "stu_work_experiences".* FROM "stu_work_experiences" WHERE "stu_work_experiences"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
	@stu_work_experience = StuWorkExperience.find(params[:id])

INSERT INTO "stu_work_experiences" ("company", "created_at", "description", "end_date", "position", "start_date", "student_profile_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @stu_work_experience = StuWorkExperience.new(params[:stu_work_experience])
    #@user = current_user
    @stu_work_experience.student_profile_id = @user.id


    respond_to do |format|
      if @stu_work_experience.save

SELECT "stu_work_experiences".* FROM "stu_work_experiences" WHERE "stu_work_experiences"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
  @stu_work_experience = StuWorkExperience.find(params[:id])