app/controllers/student_profiles_controller.rb

  def show

    @student_profile = StudentProfile.find(params[:id])
---
SELECT "student_profiles".* FROM "student_profiles" WHERE "student_profiles"."id" = ? LIMIT 1  [["id", "2"]]

  def edit

    @student_profile = StudentProfile.find(params[:id])
---
SELECT "student_profiles".* FROM "student_profiles" WHERE "student_profiles"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @student_profile = StudentProfile.new(params[:student_profile])
    @cur_user = current_user
    @student_profile.user_id = @cur_user.id
    @student_profile.id = @cur_user.id
    @student_profile.email = @cur_user.email

    respond_to do |format|
      if @student_profile.save
---
INSERT INTO "student_profiles" ("created_at", "email", "expected_graduation", "first_name", "id", "last_completed_degree", "last_name", "major", "qsort", "resume", "school", "school_year", "updated_at", "user_id", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)