app/views/qsorts/index.html.erb


    <ul id="qsorts"> <% @qsorts.each do |qsort| %>
---
SELECT "qsorts".* FROM "qsorts"